# Import Data and Libraries

In [336]:
import pandas as pd
import numpy as np
from scipy import stats 
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error, r2_score
import matplotlib.pyplot as plt
pd.set_option('display.max_columns',100) 
%matplotlib inline
import seaborn as sns
sns.set_style('darkgrid')

In [337]:
Consumer_Staples = pd.read_csv("C:/Users/Owner/Documents/GitHub/SmartInvest/Data/Consumer_Staples_JC.csv")

In [338]:
Consumer_Staples.head()

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
0,0,"May 30, 2023",760.46,762.27,754.13,756.55,756.55,"164,164,200"
1,1,"May 26, 2023",761.29,765.94,758.95,764.84,764.84,"147,625,000"
2,2,"May 25, 2023",762.06,764.78,756.94,762.16,762.16,"165,712,800"
3,3,"May 24, 2023",773.43,773.68,767.33,768.05,768.05,"128,804,700"
4,4,"May 23, 2023",776.58,776.58,771.93,773.06,773.06,"137,650,500"

In [339]:
Energy = pd.read_csv("C:/Users/Owner/Documents/GitHub/SmartInvest/Data/Energy_JC.csv")

In [340]:
Energy.head()

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
0,0,"May 30, 2023",602.51,602.51,590.07,596.86,596.86,"153,156,800"
1,1,"May 26, 2023",604.77,610.46,599.85,602.51,602.51,"138,167,500"
2,2,"May 25, 2023",616.43,616.43,599.83,604.77,604.77,"162,236,500"
3,3,"May 24, 2023",613.23,621.22,611.35,616.43,616.43,"137,879,400"
4,4,"May 23, 2023",606.94,620.61,606.94,613.23,613.23,"139,637,800"

In [391]:
Communication_Services = pd.read_csv("C:/Users/Owner/Documents/GitHub/SmartInvest/Data/Communication_Services_JC.csv")

In [392]:
Communication_Services.head()

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
0,0,"May 30, 2023",210.92,212.64,209.39,210.77,210.77,"290,422,500"
1,1,"May 26, 2023",207.37,211.14,206.53,210.92,210.92,"307,898,400"
2,2,"May 25, 2023",206.48,209.82,206.39,207.37,207.37,"399,977,700"
3,3,"May 24, 2023",207.14,207.45,205.20,206.48,206.48,"253,331,100"
4,4,"May 23, 2023",210.85,210.90,207.73,207.73,207.73,"272,091,700"

In [343]:
Industrials = pd.read_csv("C:/Users/Owner/Documents/GitHub/SmartInvest/Data/Industrials_JC.csv")

In [344]:
Industrials.head()

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
0,0,"May 30, 2023",831.07,832.83,824.67,828.48,828.48,"156,913,400"
1,1,"May 26, 2023",826.17,833.27,825.80,830.39,830.39,"153,779,000"
2,2,"May 25, 2023",821.42,826.06,817.01,824.03,824.03,"193,548,900"
3,3,"May 24, 2023",829.92,829.93,820.46,821.53,821.53,"174,945,800"
4,4,"May 23, 2023",838.55,840.97,830.95,832.07,832.07,"180,217,300"

# Analyze Data

In [345]:
Industrials.head()

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
0,0,"May 30, 2023",831.07,832.83,824.67,828.48,828.48,"156,913,400"
1,1,"May 26, 2023",826.17,833.27,825.80,830.39,830.39,"153,779,000"
2,2,"May 25, 2023",821.42,826.06,817.01,824.03,824.03,"193,548,900"
3,3,"May 24, 2023",829.92,829.93,820.46,821.53,821.53,"174,945,800"
4,4,"May 23, 2023",838.55,840.97,830.95,832.07,832.07,"180,217,300"

In [393]:
Communication_Services.head()

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
0,0,"May 30, 2023",210.92,212.64,209.39,210.77,210.77,"290,422,500"
1,1,"May 26, 2023",207.37,211.14,206.53,210.92,210.92,"307,898,400"
2,2,"May 25, 2023",206.48,209.82,206.39,207.37,207.37,"399,977,700"
3,3,"May 24, 2023",207.14,207.45,205.20,206.48,206.48,"253,331,100"
4,4,"May 23, 2023",210.85,210.90,207.73,207.73,207.73,"272,091,700"

In [347]:
Energy.head()

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
0,0,"May 30, 2023",602.51,602.51,590.07,596.86,596.86,"153,156,800"
1,1,"May 26, 2023",604.77,610.46,599.85,602.51,602.51,"138,167,500"
2,2,"May 25, 2023",616.43,616.43,599.83,604.77,604.77,"162,236,500"
3,3,"May 24, 2023",613.23,621.22,611.35,616.43,616.43,"137,879,400"
4,4,"May 23, 2023",606.94,620.61,606.94,613.23,613.23,"139,637,800"

In [348]:
Consumer_Staples.head()

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
0,0,"May 30, 2023",760.46,762.27,754.13,756.55,756.55,"164,164,200"
1,1,"May 26, 2023",761.29,765.94,758.95,764.84,764.84,"147,625,000"
2,2,"May 25, 2023",762.06,764.78,756.94,762.16,762.16,"165,712,800"
3,3,"May 24, 2023",773.43,773.68,767.33,768.05,768.05,"128,804,700"
4,4,"May 23, 2023",776.58,776.58,771.93,773.06,773.06,"137,650,500"

In [349]:
Industrials.head()
Industrials.tail()
Industrials.sample(5)

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
329,329,"Feb 04, 2022",852.94,867.60,839.76,846.52,846.52,"219,727,100"
337,337,"Jan 25, 2022",850.02,859.36,832.21,852.17,852.17,"260,921,200"
145,145,"Oct 28, 2022",783.76,800.91,781.97,800.42,800.42,"199,690,400"
328,328,"Feb 07, 2022",848.44,853.62,844.40,847.11,847.11,"227,474,300"
416,416,"Oct 01, 2021",832.04,843.05,824.65,838.50,838.50,"219,872,700"

In [350]:
Energy.head()
Energy.tail()
Energy.sample(5)

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
816,816,"Mar 03, 2020",353.68,359.75,338.67,342.64,342.64,"331,541,100"
1100,1100,"Jan 15, 2019",457.43,463.00,456.50,458.80,458.80,-
1120,1120,"Dec 14, 2018",467.05,467.05,453.83,455.93,455.93,-
40,40,"Mar 31, 2023",630.90,636.16,630.36,634.90,634.90,"143,534,900"
540,540,"Apr 07, 2021",369.60,372.77,368.63,371.23,371.23,"156,739,200"

In [351]:
Consumer_Staples.head()
Consumer_Staples.tail()
Consumer_Staples.sample(5)

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
216,216,"Jul 20, 2022",758.98,759.55,749.66,753.22,753.22,"105,942,600"
987,987,"Jun 27, 2019",596.21,598.11,594.21,596.93,596.93,"139,131,700"
991,991,"Jun 21, 2019",605.13,606.66,602.94,603.48,603.48,"247,919,000"
801,801,"Mar 24, 2020",520.50,528.42,512.39,525.19,525.19,"277,176,900"
957,957,"Aug 09, 2019",612.48,613.70,604.94,609.05,609.05,"113,201,900"

In [394]:
Communication_Services.head()
Communication_Services.tail()
Communication_Services.sample(5)

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
318,318,"Feb 22, 2022",228.72,230.30,224.54,226.48,226.48,"257,248,100"
958,958,"Aug 08, 2019",165.13,167.30,164.24,167.28,167.28,"202,464,800"
270,270,"May 02, 2022",198.03,203.10,197.26,202.83,202.83,"355,906,500"
87,87,"Jan 24, 2023",180.24,181.69,178.47,178.99,178.99,"254,493,200"
1091,1091,"Jan 29, 2019",147.02,147.02,145.01,145.46,145.46,-

In [353]:
Industrials['Date1'] = pd.to_datetime(Industrials.Date)

In [354]:
Industrials

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume,Date1
0,0,"May 30, 2023",831.07,832.83,824.67,828.48,828.48,"156,913,400",2023-05-30
1,1,"May 26, 2023",826.17,833.27,825.80,830.39,830.39,"153,779,000",2023-05-26
2,2,"May 25, 2023",821.42,826.06,817.01,824.03,824.03,"193,548,900",2023-05-25
3,3,"May 24, 2023",829.92,829.93,820.46,821.53,821.53,"174,945,800",2023-05-24
4,4,"May 23, 2023",838.55,840.97,830.95,832.07,832.07,"180,217,300",2023-05-23
...,...,...,...,...,...,...,...,...,...
1253,1253,"Jun 06, 2018",631.43,636.59,630.07,636.59,636.59,-,2018-06-06
1254,1254,"Jun 05, 2018",630.22,631.77,627.92,630.93,630.93,-,2018-06-05
1255,1255,"Jun 04, 2018",631.86,635.66,629.01,629.84,629.84,-,2018-06-04
1256,1256,"Jun 01, 2018",626.20,631.84,626.20,630.67,630.67,-,2018-06-01
1257,1257,"May 31, 2018",632.11,632.15,622.15,623.49,623.49,-,2018-05-31

In [355]:
Industrials1=Industrials.drop(["Unnamed: 0", "Date"],axis=1)

In [356]:
Industrials1

        Open    High     Low  Close* Adj Close**       Volume      Date1
0     831.07  832.83  824.67  828.48      828.48  156,913,400 2023-05-30
1     826.17  833.27  825.80  830.39      830.39  153,779,000 2023-05-26
2     821.42  826.06  817.01  824.03      824.03  193,548,900 2023-05-25
3     829.92  829.93  820.46  821.53      821.53  174,945,800 2023-05-24
4     838.55  840.97  830.95  832.07      832.07  180,217,300 2023-05-23
...      ...     ...     ...     ...         ...          ...        ...
1253  631.43  636.59  630.07  636.59      636.59            - 2018-06-06
1254  630.22  631.77  627.92  630.93      630.93            - 2018-06-05
1255  631.86  635.66  629.01  629.84      629.84            - 2018-06-04
1256  626.20  631.84  626.20  630.67      630.67            - 2018-06-01
1257  632.11  632.15  622.15  623.49      623.49            - 2018-05-31

[1258 rows x 7 columns]

In [357]:
Energy['Date1'] = pd.to_datetime(Energy.Date)

In [358]:
Energy

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume,Date1
0,0,"May 30, 2023",602.51,602.51,590.07,596.86,596.86,"153,156,800",2023-05-30
1,1,"May 26, 2023",604.77,610.46,599.85,602.51,602.51,"138,167,500",2023-05-26
2,2,"May 25, 2023",616.43,616.43,599.83,604.77,604.77,"162,236,500",2023-05-25
3,3,"May 24, 2023",613.23,621.22,611.35,616.43,616.43,"137,879,400",2023-05-24
4,4,"May 23, 2023",606.94,620.61,606.94,613.23,613.23,"139,637,800",2023-05-23
...,...,...,...,...,...,...,...,...,...
1253,1253,"Jun 06, 2018",554.30,558.77,552.54,557.43,557.43,-,2018-06-06
1254,1254,"Jun 05, 2018",556.21,558.96,552.34,554.30,554.30,-,2018-06-05
1255,1255,"Jun 04, 2018",561.37,567.25,554.92,556.21,556.21,-,2018-06-04
1256,1256,"Jun 01, 2018",558.35,564.92,558.26,561.37,561.37,-,2018-06-01
1257,1257,"May 31, 2018",563.01,565.06,557.40,558.35,558.35,-,2018-05-31

In [359]:
Energy1=Energy.drop(["Unnamed: 0", "Date"],axis=1)

In [360]:
Energy1

        Open    High     Low  Close*  Adj Close**       Volume      Date1
0     602.51  602.51  590.07  596.86       596.86  153,156,800 2023-05-30
1     604.77  610.46  599.85  602.51       602.51  138,167,500 2023-05-26
2     616.43  616.43  599.83  604.77       604.77  162,236,500 2023-05-25
3     613.23  621.22  611.35  616.43       616.43  137,879,400 2023-05-24
4     606.94  620.61  606.94  613.23       613.23  139,637,800 2023-05-23
...      ...     ...     ...     ...          ...          ...        ...
1253  554.30  558.77  552.54  557.43       557.43            - 2018-06-06
1254  556.21  558.96  552.34  554.30       554.30            - 2018-06-05
1255  561.37  567.25  554.92  556.21       556.21            - 2018-06-04
1256  558.35  564.92  558.26  561.37       561.37            - 2018-06-01
1257  563.01  565.06  557.40  558.35       558.35            - 2018-05-31

[1258 rows x 7 columns]

In [361]:
Consumer_Staples['Date1'] = pd.to_datetime(Consumer_Staples.Date)

In [362]:
Consumer_Staples

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume,Date1
0,0,"May 30, 2023",760.46,762.27,754.13,756.55,756.55,"164,164,200",2023-05-30
1,1,"May 26, 2023",761.29,765.94,758.95,764.84,764.84,"147,625,000",2023-05-26
2,2,"May 25, 2023",762.06,764.78,756.94,762.16,762.16,"165,712,800",2023-05-25
3,3,"May 24, 2023",773.43,773.68,767.33,768.05,768.05,"128,804,700",2023-05-24
4,4,"May 23, 2023",776.58,776.58,771.93,773.06,773.06,"137,650,500",2023-05-23
...,...,...,...,...,...,...,...,...,...
1253,1253,"Jun 06, 2018",510.07,510.33,506.94,510.31,510.31,-,2018-06-06
1254,1254,"Jun 05, 2018",512.34,512.57,508.12,509.59,509.59,-,2018-06-05
1255,1255,"Jun 04, 2018",509.50,512.63,509.16,512.06,512.06,-,2018-06-04
1256,1256,"Jun 01, 2018",508.82,510.14,506.57,507.88,507.88,-,2018-06-01
1257,1257,"May 31, 2018",515.42,515.42,505.96,508.01,508.01,-,2018-05-31

In [363]:
Consumer_Staples1=Consumer_Staples.drop(["Unnamed: 0", "Date"],axis=1)

In [364]:
Consumer_Staples1

        Open    High     Low  Close* Adj Close**       Volume      Date1
0     760.46  762.27  754.13  756.55      756.55  164,164,200 2023-05-30
1     761.29  765.94  758.95  764.84      764.84  147,625,000 2023-05-26
2     762.06  764.78  756.94  762.16      762.16  165,712,800 2023-05-25
3     773.43  773.68  767.33  768.05      768.05  128,804,700 2023-05-24
4     776.58  776.58  771.93  773.06      773.06  137,650,500 2023-05-23
...      ...     ...     ...     ...         ...          ...        ...
1253  510.07  510.33  506.94  510.31      510.31            - 2018-06-06
1254  512.34  512.57  508.12  509.59      509.59            - 2018-06-05
1255  509.50  512.63  509.16  512.06      512.06            - 2018-06-04
1256  508.82  510.14  506.57  507.88      507.88            - 2018-06-01
1257  515.42  515.42  505.96  508.01      508.01            - 2018-05-31

[1258 rows x 7 columns]

In [395]:
Communication_Services['Date1'] = pd.to_datetime(Communication_Services.Date)

In [396]:
Communication_Services

,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume,Date1
0,0,"May 30, 2023",210.92,212.64,209.39,210.77,210.77,"290,422,500",2023-05-30
1,1,"May 26, 2023",207.37,211.14,206.53,210.92,210.92,"307,898,400",2023-05-26
2,2,"May 25, 2023",206.48,209.82,206.39,207.37,207.37,"399,977,700",2023-05-25
3,3,"May 24, 2023",207.14,207.45,205.20,206.48,206.48,"253,331,100",2023-05-24
4,4,"May 23, 2023",210.85,210.90,207.73,207.73,207.73,"272,091,700",2023-05-23
...,...,...,...,...,...,...,...,...,...
1253,1253,"Jun 06, 2018",145.81,148.31,145.40,148.01,148.01,-,2018-06-06
1254,1254,"Jun 05, 2018",145.08,145.99,144.81,145.81,145.81,-,2018-06-05
1255,1255,"Jun 04, 2018",145.23,146.14,144.93,145.08,145.08,-,2018-06-04
1256,1256,"Jun 01, 2018",144.87,145.73,144.71,145.23,145.23,-,2018-06-01
1257,1257,"May 31, 2018",146.78,146.79,144.29,144.87,144.87,-,2018-05-31

In [397]:
Com_Serv=Communication_Services.drop(["Unnamed: 0", "Date"],axis=1)

In [398]:
Com_Serv

        Open    High     Low  Close* Adj Close**       Volume      Date1
0     210.92  212.64  209.39  210.77      210.77  290,422,500 2023-05-30
1     207.37  211.14  206.53  210.92      210.92  307,898,400 2023-05-26
2     206.48  209.82  206.39  207.37      207.37  399,977,700 2023-05-25
3     207.14  207.45  205.20  206.48      206.48  253,331,100 2023-05-24
4     210.85  210.90  207.73  207.73      207.73  272,091,700 2023-05-23
...      ...     ...     ...     ...         ...          ...        ...
1253  145.81  148.31  145.40  148.01      148.01            - 2018-06-06
1254  145.08  145.99  144.81  145.81      145.81            - 2018-06-05
1255  145.23  146.14  144.93  145.08      145.08            - 2018-06-04
1256  144.87  145.73  144.71  145.23      145.23            - 2018-06-01
1257  146.78  146.79  144.29  144.87      144.87            - 2018-05-31

[1258 rows x 7 columns]

In [431]:
Industrials1['Open'] = pd.to_numeric(Industrials1['Open'], errors='coerce')

In [432]:
Industrials1['Close*'] = pd.to_numeric(Industrials1['Close*'], errors='coerce')

In [433]:
Industrials1.Open.describe()

count    1255.000000
mean      728.240534
std       112.353174
min       426.470000
25%       636.120000
50%       722.000000
75%       841.875000
max       906.660000
Name: Open, dtype: float64

In [438]:
Com_Serv['Open'] = pd.to_numeric(Industrials1['Open'], errors='coerce')

In [439]:
Com_Serv['Close*'] = pd.to_numeric(Industrials1['Close*'], errors='coerce')

In [440]:
Com_Serv.Open.describe()

count    1255.000000
mean      728.240534
std       112.353174
min       426.470000
25%       636.120000
50%       722.000000
75%       841.875000
max       906.660000
Name: Open, dtype: float64

In [441]:
Consumer_Staples1['Open'] = pd.to_numeric(Industrials1['Open'], errors='coerce')

In [442]:
Consumer_Staples1['Close*'] = pd.to_numeric(Industrials1['Close*'], errors='coerce')

In [443]:
Consumer_Staples1.Open.describe()

count    1255.000000
mean      728.240534
std       112.353174
min       426.470000
25%       636.120000
50%       722.000000
75%       841.875000
max       906.660000
Name: Open, dtype: float64

In [369]:
column1 = Energy1["Open"]
column2 = Energy1["Close*"]

In [370]:
Variants = column2 - column1

In [371]:
Energy1

        Open    High     Low  Close*  Adj Close**       Volume      Date1
0     602.51  602.51  590.07  596.86       596.86  153,156,800 2023-05-30
1     604.77  610.46  599.85  602.51       602.51  138,167,500 2023-05-26
2     616.43  616.43  599.83  604.77       604.77  162,236,500 2023-05-25
3     613.23  621.22  611.35  616.43       616.43  137,879,400 2023-05-24
4     606.94  620.61  606.94  613.23       613.23  139,637,800 2023-05-23
...      ...     ...     ...     ...          ...          ...        ...
1253  554.30  558.77  552.54  557.43       557.43            - 2018-06-06
1254  556.21  558.96  552.34  554.30       554.30            - 2018-06-05
1255  561.37  567.25  554.92  556.21       556.21            - 2018-06-04
1256  558.35  564.92  558.26  561.37       561.37            - 2018-06-01
1257  563.01  565.06  557.40  558.35       558.35            - 2018-05-31

[1258 rows x 7 columns]

In [372]:
Energy2 = pd.concat([Energy1, Variants.rename("Difference")], axis=1)

In [373]:
Energy2

,Open,High,Low,Close*,Adj Close**,Volume,Date1,Difference
0,602.51,602.51,590.07,596.86,596.86,"153,156,800",2023-05-30,-5.65
1,604.77,610.46,599.85,602.51,602.51,"138,167,500",2023-05-26,-2.26
2,616.43,616.43,599.83,604.77,604.77,"162,236,500",2023-05-25,-11.66
3,613.23,621.22,611.35,616.43,616.43,"137,879,400",2023-05-24,3.20
4,606.94,620.61,606.94,613.23,613.23,"139,637,800",2023-05-23,6.29
...,...,...,...,...,...,...,...,...
1253,554.30,558.77,552.54,557.43,557.43,-,2018-06-06,3.13
1254,556.21,558.96,552.34,554.30,554.30,-,2018-06-05,-1.91
1255,561.37,567.25,554.92,556.21,556.21,-,2018-06-04,-5.16
1256,558.35,564.92,558.26,561.37,561.37,-,2018-06-01,3.02
1257,563.01,565.06,557.40,558.35,558.35,-,2018-05-31,-4.66

In [435]:
column1 = Industrials1["Open"]
column2 = Industrials1["Close*"]

In [436]:
Industrials1['Difference'] = column2 - column1

In [437]:
Industrials1

,Open,High,Low,Close*,Adj Close**,Volume,Date1,Difference
0,831.07,832.83,824.67,828.48,828.48,"156,913,400",2023-05-30,-2.59
1,826.17,833.27,825.80,830.39,830.39,"153,779,000",2023-05-26,4.22
2,821.42,826.06,817.01,824.03,824.03,"193,548,900",2023-05-25,2.61
3,829.92,829.93,820.46,821.53,821.53,"174,945,800",2023-05-24,-8.39
4,838.55,840.97,830.95,832.07,832.07,"180,217,300",2023-05-23,-6.48
...,...,...,...,...,...,...,...,...
1253,631.43,636.59,630.07,636.59,636.59,-,2018-06-06,5.16
1254,630.22,631.77,627.92,630.93,630.93,-,2018-06-05,0.71
1255,631.86,635.66,629.01,629.84,629.84,-,2018-06-04,-2.02
1256,626.20,631.84,626.20,630.67,630.67,-,2018-06-01,4.47
1257,632.11,632.15,622.15,623.49,623.49,-,2018-05-31,-8.62

In [444]:
column1 = Com_Serv["Open"]
column2 = Com_Serv["Close*"]

In [445]:
Com_Serv['Difference'] = column2 - column1

In [446]:
Com_Serv

,Open,High,Low,Close*,Adj Close**,Volume,Date1,Difference
0,831.07,212.64,209.39,828.48,210.77,"290,422,500",2023-05-30,-2.59
1,826.17,211.14,206.53,830.39,210.92,"307,898,400",2023-05-26,4.22
2,821.42,209.82,206.39,824.03,207.37,"399,977,700",2023-05-25,2.61
3,829.92,207.45,205.20,821.53,206.48,"253,331,100",2023-05-24,-8.39
4,838.55,210.90,207.73,832.07,207.73,"272,091,700",2023-05-23,-6.48
...,...,...,...,...,...,...,...,...
1253,631.43,148.31,145.40,636.59,148.01,-,2018-06-06,5.16
1254,630.22,145.99,144.81,630.93,145.81,-,2018-06-05,0.71
1255,631.86,146.14,144.93,629.84,145.08,-,2018-06-04,-2.02
1256,626.20,145.73,144.71,630.67,145.23,-,2018-06-01,4.47
1257,632.11,146.79,144.29,623.49,144.87,-,2018-05-31,-8.62

In [447]:
column1 = Consumer_Staples1["Open"]
column2 = Consumer_Staples1["Close*"]

In [448]:
Consumer_Staples1['Difference'] = column2 - column1

In [449]:
Consumer_Staples1

,Open,High,Low,Close*,Adj Close**,Volume,Date1,Difference
0,831.07,762.27,754.13,828.48,756.55,"164,164,200",2023-05-30,-2.59
1,826.17,765.94,758.95,830.39,764.84,"147,625,000",2023-05-26,4.22
2,821.42,764.78,756.94,824.03,762.16,"165,712,800",2023-05-25,2.61
3,829.92,773.68,767.33,821.53,768.05,"128,804,700",2023-05-24,-8.39
4,838.55,776.58,771.93,832.07,773.06,"137,650,500",2023-05-23,-6.48
...,...,...,...,...,...,...,...,...
1253,631.43,510.33,506.94,636.59,510.31,-,2018-06-06,5.16
1254,630.22,512.57,508.12,630.93,509.59,-,2018-06-05,0.71
1255,631.86,512.63,509.16,629.84,512.06,-,2018-06-04,-2.02
1256,626.20,510.14,506.57,630.67,507.88,-,2018-06-01,4.47
1257,632.11,515.42,505.96,623.49,508.01,-,2018-05-31,-8.62

In [453]:
Consumer_Staples1.to_csv('C:/Users/Owner/Documents/GitHub/SmartInvest/Data/CS_Graphing_Data_JC.csv')

In [454]:
Com_Serv.to_csv('C:/Users/Owner/Documents/GitHub/SmartInvest/Data/CommS_Graphing_Data_JC.csv')

In [455]:
Industrials1.to_csv('C:/Users/Owner/Documents/GitHub/SmartInvest/Data/INDS_Graphing_Data_JC.csv')

In [456]:
Energy2.to_csv('C:/Users/Owner/Documents/GitHub/SmartInvest/Data/Energy_Graphing_Data_JC.csv')